In [4]:
2+2

4

In [5]:
prices_a = [8.70,8.91,8.71]

In [5]:
8.91/8.70-1

0.024137931034482918

In [6]:
8.71/8.91-1

-0.022446689113355678

In [7]:
prices_a[1:
        ]

[8.91, 8.71]

In [8]:
prices_a[:-1 ]

[8.7, 8.91]

In [9]:
import numpy as np

In [10]:
prices_a = np.array([8.70,8.91,8.71])
prices_a

array([8.7 , 8.91, 8.71])

In [11]:
prices_a[1:]/prices_a[:-1]-1

array([ 0.02413793, -0.02244669])

In [12]:
import pandas as pd 
prices = pd.DataFrame({"BLUE":[8.70,8.91,8.71,8.43,8.73]
                      ,
                     "ORANGE":[10.66,11.08,10.71,11.59,12.11]})

In [28]:
prices

   BLUE  ORANGE
0  8.70   10.66
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59
4  8.73   12.11

In [13]:
prices.iloc[1:]

   BLUE  ORANGE
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59
4  8.73   12.11

In [14]:
prices.iloc[:-1]

   BLUE  ORANGE
0  8.70   10.66
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59

In [15]:
prices.iloc[1:].values/prices.iloc[:-1]-1

       BLUE    ORANGE
0  0.024138  0.039400
1 -0.022447 -0.033394
2 -0.032147  0.082166
3  0.035587  0.044866

In [16]:
prices/prices.shift(1)-1

       BLUE    ORANGE
0       NaN       NaN
1  0.024138  0.039400
2 -0.022447 -0.033394
3 -0.032147  0.082166
4  0.035587  0.044866

In [17]:
prices

   BLUE  ORANGE
0  8.70   10.66
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59
4  8.73   12.11

In [36]:
prices.pct_change()

       BLUE    ORANGE
0       NaN       NaN
1  0.024138  0.039400
2 -0.022447 -0.033394
3 -0.032147  0.082166
4  0.035587  0.044866

In [29]:
prices_MSFT = pd.read_csv('data/MSFT.csv')
prices_MSFT

,Date,Open,High,Low,Close,Adj Close,Volume
0,2021-06-14,257.899994,259.950012,256.799988,259.890015,257.785034,19150500
1,2021-06-15,259.769989,259.989990,257.679993,258.359985,256.267426,18038900
2,2021-06-16,259.399994,260.579987,254.419998,257.380005,255.295380,27220000
3,2021-06-17,256.070007,261.750000,256.010010,260.899994,258.786835,27565500
4,2021-06-18,259.630005,262.299988,258.750000,259.429993,257.328766,37202200
...,...,...,...,...,...,...,...
247,2022-06-06,272.059998,274.179993,267.220001,268.750000,268.750000,22400300
248,2022-06-07,266.640015,273.130005,265.940002,272.500000,272.500000,22860700
249,2022-06-08,271.709991,273.000000,269.609985,270.410004,270.410004,17372300
250,2022-06-09,267.779999,272.709991,264.630005,264.790009,264.790009,26439700
251,2022-06-10,260.579987,260.579987,252.529999,252.990005,252.990005,31422800